src/config/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Comment>Магнитные и штриховые карты.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПрефиксКода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидокИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДисконтнойКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактДомашнийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактДомашнийТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактСотовыйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактПаспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыСкидокИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыСкидокИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Накопительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/СтатусыДисконтнойКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыДисконтнойКарты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неактивна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/ИнформационныеКарты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Если Не ЭтоГруппа Тогда
			
			Если ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная Тогда
				
				Если ВидСкидки = Перечисления.ВидыСкидокИнформационныхКарт.Накопительная Тогда
					
					Если ПроцентСкидки <> 0 Тогда
						ПроцентСкидки = 0;
					КонецЕсли; 
					
				Иначе
					
					Если СтатусДисконтнойКарты = Перечисления.СтатусыДисконтнойКарты.Активна
						И ПроцентСкидки = 0 Тогда
						СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): не заполнен процент скидки. Элемент не записан!", Отказ);
					КонецЕсли; 
					
					Если Не РазрешитьРасширенныеОперацииСДисконтнымиКартами() Тогда
						
						Если ПроцентСкидки <> Константы.ПроцентСкидкиVIPКарты.Получить() Тогда
							СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): процент скидки не равен текущему проценту скидки VIP-карты. Элемент не записан!", Отказ);
						КонецЕсли; 
						
						Если ЗначениеНеЗаполнено(Основание) Тогда
							СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): для VIP-карты не указана карта основание. Элемент не записан!", Отказ);
						КонецЕсли; 
						
						Если Не (Основание.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная
							И Основание.ВидСкидки = Перечисления.ВидыСкидокИнформационныхКарт.Накопительная) Тогда
							СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): карта основание для VIP-карты не дисконтная или не накопительная. Элемент не записан!", Отказ);
						КонецЕсли; 
						
					КонецЕсли; 
				КонецЕсли; 
				
				Если Не яштАдминистративныеФункцииДоступны() Тогда
					
					Если Не ЗначениеНеЗаполнено(ВладелецКарты) Тогда
						СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): поле ""Владелец карты"" не должно заполняться для дисконтной карты. Элемент не записан!", Отказ);
					КонецЕсли; 
					
					Если ЭтоПрефиксКода Тогда
						СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): флаг ""Это префикс кода"" не может быть установлен. Элемент не записан!", Отказ);
					КонецЕсли; 
					
				КонецЕсли; 
				
				Если Ссылка.СтатусДисконтнойКарты = Перечисления.СтатусыДисконтнойКарты.Неактивна
					И СтатусДисконтнойКарты = Перечисления.СтатусыДисконтнойКарты.Активна Тогда
					
					ДатаАктивации = ТекущаяДата();
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		обЗаписатьПротоколИзменений(ЭтотОбъект);
		
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
	
		Если Не ЭтоГруппа Тогда
		
			// аннулировать карту-основание
			Если Не ЗначениеНеЗаполнено(Основание)
				И Основание.СтатусДисконтнойКарты <> Перечисления.СтатусыДисконтнойКарты.Аннулирована Тогда
				
				врОб = Основание.ПолучитьОбъект();
				врОб.СтатусДисконтнойКарты = Перечисления.СтатусыДисконтнойКарты.Аннулирована;
				Попытка
					врОб.Записать();
				Исключение
					СообщитьОбОшибке("Запись информационной карты """ + Наименование + """ (" + Код + "): не удалось аннулировать карту-основание. Элемент не записан! Текст ошибки: " + ОписаниеОшибки(), Отказ);
					Возврат;
				КонецПопытки;
				
			КонецЕсли; 

		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры
